#include <bits/stdc++.h>
using namespace std;

int main()
{
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    int T;
    cin >> T;
    while (T--)
    {
        int N;
        cin >> N;

        // reverse permutation gives minimal LCM
        for (int i = 1; i <= N; i++)
        {
            cout << (N - i + 1) << " ";
        }
        cout << "\n";
    }
    return 0;
}

// তোমাকে এমন একটি permutation A বানাতে হবে যেটাতে এই expression-এর LCM সবচেয়ে ছোট হয়:
// LCM( 1 + A1 , 2 + A2 , 3 + A3 , ... , N + AN )

// মানে:
// i-th position এ: Value = i + A[i]
// তারপর সব value এর LCM বের করতে হবে।

// Goal:
// 👉 এই LCM যত কম সম্ভব করতে হবে।
// ⭐ 3️⃣ LCM minimize করার rule কী?

// 👉 LCM ছোট হয় যখন সব সংখ্যাই একই হয়
// বা একই ধরনের factor থাকে।

// Example:
// LCM(5,5,5,5) = 5
// LCM(7,7,7) = 7
// LCM(12,12) = 12

// একই সংখ্যা → LCM = সেই সংখ্যা।
// A[i] = N - i + 1
// For any i:
// i + (N - i + 1)
// = N + 1
// Wow 😮
// সবার sum = একই সংখ্যা!